{
  "hardware engineering": [
    "https://philip-haas.com/about/",
    "https://paulbuchheit.blogspot.com/",
    "https://www.paulgraham.com/articles.html",
    "Bait Bulb",
    "Electro-Mechanical Engineering",
    "From miniature mechanical implants to large scale automated production lines, my industry experience runs the gamut. As a multi-discipline engineer I often find my place on a team is to bridge the divide between industrial design, mechanical engineers, and electrical engineering requirements to facilitate rapid product development. With my deep understanding of all manufacturing processes involved, DFM is implemented early in the design process providing faster transitions to medium & full scale deployment.",
    "PCBA Design & Manufacturing",
    "Schematic capture, layout, and routing of circuit boards ranging from single sided development boards to rigid-flex multilayer production assemblies. Component package generation for new or specialised chipsets to ensure seamless transition to manufacturing. Failure analysis and process control of PCB fabrication and PCBA population to ensure high-yield and minimal defects. Test and programming fixture design and production.",
    "Electro-Mechanical Prototyping",
    "Combining various rapid prototyping techniques, CNC machining, laser engraving, and small batch PCBA fabrication. Prototypes can be quickly produced in-house to facilitate all steps of the development process. From quick turn models for industrial design refinement, to 3D printed tooling for first turn part production. Circuit boards can populated in-house for rapid turn prototyping, hand rework of PCBs to adjust for design changes.",
    "Digital Prototypes",
    "Photo-realistic renderings of product designs to assist in all stages of development. Creating digital prototypes for team & investor buy-in can be a crucial step for both startups and established companies. Establishing required surface finishes and coloration to guide the electro-mechanical design process with material and post-processing guidelines. Specifications on material treatments or injection molded surface requirements provides for rapid transitions to manufacturing.",
    "Manufacturing",
    "With in-house 3-4 Axis CNC Milling, large format 5 axis CNC routers, CNC Laser / Plasma cutting, Small batch anodizing, powder coating, Fiber laser engraving, and soft goods manufacturing equipment; prototyping & first batch manufacturing can be completed quickly. Assisting in re-shoring of product manufacturing has been the key to success for many of my clients.",
    "Industrial Automation",
    "Automating manufacturing, assembly, & packaging can be a complex undertaking for any sized organization. Leveraging a combination of custom designed & fabricated equipment, OTS machinery, and streamlined internal processes to maximize throughput. Working around space requirements and necessary facility infrastructure upgrades to design staged automation rollouts.",
    "Reverse Engineering",
    "When working in industries with bespoke or highly specialized equipment & workflows defining key processes can be a challenge. I specialize in working with critical industries who endeavor to re-shore their technologies and processes. My goal is to expand access to technology & critical manufacturing infrastructure for enhancing quality of life and national security.",
    "https://ocw.mit.edu/search/?d=Mechanical%20Engineering&q=mechanical&s=department_course_numbers.sort_coursenum&type=course",
    "aquatic robotics",
    "drones",
    "autonomous vehicles",
    "3d printing",
    "laser cutting",
    "water jet cutting",
    "sheet metal fabrication",
    "welding",
    "robotics",
    "automation",
    "reverse engineering",


    "",
  ],
  "misct/mech_eng": [
    "https://www.paulgraham.com/articles.html"
  ]
}






























}